app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "kishna"], ["email", "simaba@gmail.com"], ["password", "123"], ["created_at", "2020-12-22 23:32:40.635318"], ["updated_at", "2020-12-22 23:32:40.635318"]]

  def edit
    # render
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    # actually create in DB
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "456"], ["updated_at", "2020-12-22 23:40:44.823629"], ["id", 1]]